[
{"job_url": "https://ro.linkedin.com/jobs/view/data-engineering-bi-analyst-intern-at-tecknoworks-3698156229?refId=E873y%2FHzfEZ3IECgwjuahw%3D%3D&trackingId=%2FyzdPaopI%2Faig0DSY0Z0%2BA%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card", "job_title": "Data Engineering & BI Analyst Intern", "job_company": "Tecknoworks", "job_nr_candidates": "153", "job_description": "\n        Are you enthusiastic about working with data and transforming it into meaningful insights? Are you interested in honing your skills in data engineering and business intelligence? If you have a passion for data-driven decision-making and want to embark on a journey to become a proficient Data Engineer and BI Analyst, we invite you to join our dynamic team for a comprehensive internship/pre-employment training program.About Us:  We are a forward-thinking company dedicated to leveraging data to drive strategic decisions and innovation. We aim to empower businesses with actionable insights derived from structured and unstructured data. By joining us, you'll be part of a team that values creativity, collaboration, and continuous learning.Position Overview:  As a Data Engineering Intern within the BI field, you'll have the unique opportunity to gain hands-on experience in data engineering and business intelligence. You'll work with cutting-edge tools and technologies to build, maintain, and optimize data pipelines, databases, and visualizations.This program aims to equip you with the skills needed to excel in data engineering and BI and may lead to a potential full-time role within our organization.What you will learn:Collaborate with the data engineering team to design, build, and maintain pipelines that extract, transform, and load data from various sources into our data warehouseDevelop data integration processes to ensure a seamless data flow across different systemsParticipate in data quality initiatives to ensure data accuracy, consistency, and completenessAssist in performance tuning and optimization of data pipelines to enhance efficiencyWork closely with business stakeholders to understand their data requirements and develop interactive dashboards and reports using BI tools (e.g., Power BI, Fabric)Transform raw data into insightful visualizations that provide actionable insights for decision-makingCollaborate with the data engineering team to ensure that data is available, accurate, and well-structured for BI reportingParticipate in user training sessions to promote self-service analytics within the organizationWhat are the strengths you will acquire:Get knowledge and experience that will prepare you for the top Microsoft certifications related to data analytics that will consolidate your careerGet hands-on, 360-degree experience on projects with cross-functional teams to understand business needs and provide data-driven solutionsBecome fully equipped for a high-demand job and learn how the BI industry shapes the data landscape across the globeQualifications:Pursuing or recently completed a degree in Computer Science, Data Science, Business Information Systems, or a related fieldBasic understanding of databases, data modeling, and SQLFamiliarity with programming languages such as PythonInterest in data visualization and familiarity with BI tools (Power BI, Fabric, etc.)Strong analytical mindset and problem-solving skillsEffective communication and teamwork abilitiesEagerness to learn and adapt to new technologies and methodologiesBenefits:Hands-on experience working on data projectsMentorship and guidance from experienced data professionalsExposure to a variety of data tools and technologiesPotential for a full-time position upon successful completion of the internship/trainingEmbark on a journey to become a skilled Data Engineer and BI Analyst.Apply now to kickstart your career in the world of data-driven decision-making!\n      ", "job_level": "Internship", "job_program_type": "Internship", "job_category": "Research, Analyst, and Information Technology", "job_activity_sector": "Technology, Information and Internet"},
{"job_url": "https://ro.linkedin.com/jobs/view/big-data-engineer-mostly-remote-at-banca-transilvania-3711201052?refId=E873y%2FHzfEZ3IECgwjuahw%3D%3D&trackingId=vcAnfX6ike7KXhUJceX0jQ%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card", "job_title": "Big Data Engineer (mostly remote)", "job_company": "Banca Transilvania", "job_nr_candidates": 0, "job_description": "\nHey, you! 👋Do you want to be part of a team where we focus on a positive working environment in a dynamic workplace, that it has both a complex and with an easy-going vibe? Do you want your work to have a direct impact for the people around you, while working for Romania’s biggest bank, a product and people-oriented company?If so, come and become one of the #peopleOfBT. Come meet us and we will tell you more about what this means👩‍💻Responsibilities:Actively work on our development projects, making use of the BigData ecosystem toolsData discovery and data analyticsPreparing intuitive data visualization that tell the story of the processed dataPrepare proper deployment pipelines using CI/CDWork with the devops and infrastructure teams to define and maintain the working environmentsActively research on the latest technologies Technology stack:The ideal candidate should have experience with most of the following technologies, with a focus on BigData:ScalaHadoopSparkKafkaNiFiMongoLinuxDockerJenkinsSQLNice to have:DruidSupersetSnowflakeBigData cluster managementEach project will have its particularities and we will have to adapt so that we can support the development lifecycle following the industry’s best practices🤝\n", "job_level": "Mid-Senior level", "job_program_type": "Full-time", "job_category": "Information Technology and Engineering", "job_activity_sector": "Banking"},
{"job_url": "https://ro.linkedin.com/jobs/view/new-graduate-hr-generalist-at-canonical-3686712094?refId=E873y%2FHzfEZ3IECgwjuahw%3D%3D&trackingId=dheLf6B1nBqclMeaJ9amUg%3D%3D&position=24&pageNum=0&trk=public_jobs_jserp-result_search-card", "job_title": "New Graduate HR Generalist", "job_company": "Canonical", "job_nr_candidates": "59", "job_description": "\nWe have openings for recent graduates in our global team of HR Generalists, one in each major region of the world. We are holding these positions for truly exceptional individuals who will graduate from their first undergraduate degree in the next year, or who have graduated in the last six months at the time of application. We will assess candidates on the basis of academic achievement and extramural leadership. Candidates will need to show a track record at school and university of consistent over-achievement as well as evidence of a desire and ability to learn, drive and shape HR practices on the global stage in a rapidly changing world.Our people are based in more than 70 countries around the world. Our HR department depends on the precise application of policy and process as well as a depth of compliance and People partnering to make us an efficient, friendly, quality-driven, real-time service. The Associate HR Generalist will be responsible for supporting and coordinating general HR activities supporting our AMER, EMEA and APAC regions and driving our HR processes. This is a great opportunity to start and progress your career in a People function supporting team members worldwide.The successful candidate will bring an exceptional academic track record coupled with some experience working in an entry-level role in an HR or People Team. You will bring some existing knowledge of employment law. Ideally, we are looking for someone who has an inherent interest in the Technology sector, specifically Open Source.Location: These roles can be held in any time zone. We have HR teams for EMEA, APAC and the Americas.What your day will look likeProvide HR support by answering team members' questions and responding to requests regarding their employment and contracts, escalating when necessary. Requests may include information about the new starter process and onboarding, questions regarding global benefits, employment verifications, and other general inquiries. Maintain our HRIS, ensuring a high degree of accuracy and timeliness in processing all team member changes and new joiners. Owning global projects (e.g. engagement, training or culture initiatives)Partnering with the managers and employees - supporting HR processes and driving the people strategy for your areas of responsibilityWorking as a truly global partner to colleagues, especially leads, managers and executivesProcess new hires, including country-specific on-boarding documentation, creation of files, systems set-up, and coordination of introductory reviews. Provide support to employees for the enrollment and processing of benefits and the payroll process, ensuring monthly data is provided on time and is accurate. Liaise with payroll to guarantee smooth salary payments. Create purchase orders for internal departments. Provide administrative support to employees for the enrollment and processing of benefits. Conduct regular audits of employment files and systems to ensure they are up-to-date, accurate, and GDPR compliant. Continually work to better our processes, spotting areas we can improve to drive our function forward. Conduct and manage global background checks. What we are looking for in youAn exceptional academic track record from both high school and preferably universityExperience working in an entry-level role in an HR/People team is beneficial, preferably in the Technology industry. Excellent verbal and written communication skills. Able to prioritize complex workloads, manage time effectively and work well under pressure. Self-motivated and results-orientated with a clear focus on accuracy. High level of honesty, integrity, and ability to handle confidential data. Flexible attitude and easily adaptable to change. Willing to take the initiative and provide suggestions and ideas to contribute to the success of the role/team. Ambitious to grow your career within HR. Willingness to travel up to 4 times a year for internal eventsWhat we offer youWe consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus which varies based on seniority but starts at a range up to 10%. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to ensure fairness globally.Distributed work environment with twice-yearly team sprints in person - we've been working remotely since 2004!Personal learning and development budget of USD 2,000 per yearAnnual compensation reviewRecognition rewardsAnnual holiday leaveMaternity and paternity leaveEmployee Assistance ProgrammeOpportunity to travel to new locations to meet colleagues from your team and othersPriority Pass for travel and travel upgrades for long haul company eventsAbout CanonicalCanonical is a pioneering tech firm that is at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do.Canonical has been a remote-first company since its inception in 2004. Work at Canonical is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game. Canonical provides a unique window into the world of 21st-century digital business.Canonical is an equal opportunity employerWe are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.\n", "job_level": "Mid-Senior level", "job_program_type": "Contract", "job_category": "Human Resources", "job_activity_sector": "Technology, Information and Internet"},
{"job_url": "https://ro.linkedin.com/jobs/view/cybersecurity-specialist-at-e-infra-3667174685?refId=E873y%2FHzfEZ3IECgwjuahw%3D%3D&trackingId=FPzCK8fzKGg5IvzFD0NLrQ%3D%3D&position=23&pageNum=0&trk=public_jobs_jserp-result_search-card", "job_title": "Cybersecurity Specialist", "job_company": "E-INFRA", "job_nr_candidates": "170", "job_description": "\n        We are seeking a highly motivated and experienced Cybersecurity Specialist to join our team. The successful candidate will be responsible for protecting our company's networks, computer systems, and data from cyber threats. This individual will work closely with the IT team to identify potential vulnerabilities and implement security measures to safeguard against cyber attacks.Responsibilities:Monitor computer networks and systems for security breaches and investigate incidents when they occur.Implement and maintain security measures such as firewalls, intrusion detection systems, and encryption protocols.Develop and implement security policies and procedures to ensure compliance with industry standards and regulations.Conduct regular security audits and vulnerability assessments to identify potential risks and weaknesses.Keep up-to-date with the latest trends and technologies in cybersecurity to stay ahead of potential threats.Respond to security incidents in a timely manner and provide recommendations for remediation.Work closely with the IT team to ensure that all systems and applications are up-to-date with the latest security patches and updates.Requirements:Bachelor's degree in Computer Science, Information Technology, or related field or security certificates.Minimum of 3 years of experience in cybersecurity or related field.Experience with security tools and technologies such as firewalls, intrusion detection systems, encryption protocols and Cloud.Knowledge of industry standards and regulations such as HIPAA, PCI-DSS, and GDPR.Strong analytical and problem-solving skills.Excellent communication and interpersonal skills.Ability to work independently and as part of a team.Preferred Qualifications:Professional certifications such as Certified Information Systems Security Professional (CISSP) or CompTIA Security+.Experience with cloud-based security solutions.Knowledge of scripting languages such as Python or PowerShell.Microsoft Defender would be a plus.Bit Defender would also be a plus.If you are passionate about cybersecurity and have a strong desire to protect our company's networks and data from cyber threats, we encourage you to apply for this exciting opportunity.Powered by JazzHRkuYfBSulnQ\n      ", "job_level": "Mid-Senior level", "job_program_type": "Full-time", "job_category": "Engineering and Information Technology", "job_activity_sector": "Internet Publishing"},
{"job_url": "https://ro.linkedin.com/jobs/view/data-manager-at-profi-3687096345?refId=E873y%2FHzfEZ3IECgwjuahw%3D%3D&trackingId=Ui8RljRg7B9MbOqDwQAlrg%3D%3D&position=22&pageNum=0&trk=public_jobs_jserp-result_search-card", "job_title": "Data Manager", "job_company": "Profi", "job_nr_candidates": 0, "job_description": "\nCe facem noi pentru tine?Everything we develop in PROFI is possible thanks to the contribution of each one of us.Our values, born from how we are and behave every day, are the basic commitments of our company and reflect how we relate to those around us.We know that the learning process is continuous and we are glad that in Profi we have all the opportunities and open perspectives for DEVELOPMENT.We share ideas, develop initiatives and support each other because team performance is easier to achieve through COOPERATION.We know the company’s vision and what others expect from us, and we strengthen our professional relationships with honesty and TRANSPARENCY.We are looking for kind and involved people, who want to perform with us, we are more thancolleagues from Profi, the largest employer in the private sector in Romania.We, #OameniiDeLaprofi, are always united by the ambition to take the company to the next level together.Dacă Ai`-Education: A bachelor’s or master’s degree in Computer science, Information Systems, or another related field is usually required.Communication Skills: Strong communication and interpersonal skills are essential, as you will be working closely with business stakeholders and technical teams to implement data management and reporting solutions. Able to demonstrate capability to ‘tell stories’ with Data!Leadership Skills: Strong leadership skills are necessary to recruit and manage a team of data analysts and other staff responsible for data management and reporting.Analytical Skills: Strong analytical skills are necessary to analyze data and identify trends and insights that can inform business decisions.Problem-Solving Skills: Strong problem-solving skills are necessary to identify and resolve data management issues and to develop innovative solutions to complex business.Technical Skills: Strong technical skills in data management, data warehousing, business intelligence, analytics, and reporting are essential. Experience with ETL tools, SQL, and BI platforms such as Tableau, Power BI, or Qlik is usually required.Design and implementation of KPIs for both the Business and the Data function!Industry Experience: Retail industry experience is highly desirable, as it allows you to understand the unique data needs of a retail enterprise. Experience with point-of-sale systems, inventory management systems, and customer relationship management systems is also highly desirable.Ce vei face tu pentru noi?`-Analytics and Business Intelligence Strategy: You will be responsible for developing and implementing a business intelligence strategy that aligns with the company’s overall strategic objectives. This includes identifying opportunities for using data and analytics to improve business processes, reduce costs, and increase revenue.Data Management and Governance: you will be responsible for managing the company’s data assets, including data quality, data governance, data architecture, data modeling, and data security. You will define data standards, policies, and procedures to ensure that the company’s data is accurate and consistent across all systems. You will need to work closely with business teams to ensure they effectively manage and maintain good data quality and governance.Reporting and Analytics: You will be responsible for developing and managing the company’s reporting and analytics capabilities. This includes designing and implementing reporting and analytics solutions, such as dashboards, scorecards, and ad-hoc reports, to support business decision-making.Data Integration: You will be responsible for integrating data from various sources, such as point-of-sale systems, inventory management systems, and customer relationship management systems, into a centralized data warehouse. This involves designing and implementing data integration solutions that enable data to be extracted, transformed, and loaded into the data warehouse.Team Building: Up to now Profi has relied on third parties to deliver key Data capabilities. You will be responsible for working with them, but also building the team that allows us to bring this capability in house.\n", "job_level": "Mid-Senior level", "job_program_type": "Full-time", "job_category": "Information Technology", "job_activity_sector": "Retail"},
{"job_url": "https://ro.linkedin.com/jobs/view/junior-hr-generalist-at-canonical-3686567390?refId=E873y%2FHzfEZ3IECgwjuahw%3D%3D&trackingId=KEePVyzkvBxSGIWT2fQEmQ%3D%3D&position=21&pageNum=0&trk=public_jobs_jserp-result_search-card", "job_title": "Junior HR Generalist", "job_company": "Canonical", "job_nr_candidates": 0, "job_description": "\n        We have colleagues in more than 70 countries around the world. Our HR department depends on the precise application of policy and process as well as a depth of compliance and People partnering to make us an efficient, friendly, quality-driven, real-time service. The Associate HR Generalist will be responsible for supporting and coordinating general HR activities supporting our AMER, EMEA and APAC regions and driving our HR processes. This is a great opportunity to start and progress your career in a People function supporting team members worldwide.The successful candidate will bring an exceptional academic track record coupled with some experience working in an entry-level role in an HR or People Team. You will bring some existing knowledge of employment law. Ideally, we are looking for someone who has an inherent interest in the Technology sector, specifically Open Source.Location: These roles can be held in any time zone. We have HR teams for EMEA, APAC and the Americas.What your day will look likeProvide HR support by answering team members' questions and responding to requests regarding their employment and contracts, escalating when necessary. Requests may include information about the new starter process and onboarding, questions regarding global benefits, employment verifications, and other general inquiries. Maintain our HRIS, ensuring a high degree of accuracy and timeliness in processing all team member changes and new joiners. Owning global projects (e.g. engagement, training or culture initiatives)Partnering with the managers and employees - supporting HR processes and driving the people strategy for your areas of responsibilityWorking as a truly global partner to colleagues, especially leads, managers and executivesProcess new hires, including country-specific on-boarding documentation, creation of files, systems set-up, and coordination of introductory reviews. Provide support to employees for the enrollment and processing of benefits and the payroll process, ensuring monthly data is provided on time and is accurate. Liaise with payroll to guarantee smooth salary payments. Create purchase orders for internal departments. Provide administrative support to employees for the enrollment and processing of benefits. Conduct regular audits of employment files and systems to ensure they are up-to-date, accurate, and GDPR compliant. Continually work to better our processes, spotting areas we can improve to drive our function forward. Conduct and manage global background checks. What we are looking for in youAn exceptional academic track record from both high school and preferably universityExperience working in an entry-level role in an HR/People team is beneficial, preferably in the Technology industry. Excellent verbal and written communication skills. Able to prioritize complex workloads, manage time effectively and work well under pressure. Self-motivated and results-orientated with a clear focus on accuracy. High level of honesty, integrity, and ability to handle confidential data. Flexible attitude and easily adaptable to change. Willing to take the initiative and provide suggestions and ideas to contribute to the success of the role/team. Ambitious to grow your career within HR. Willingness to travel up to 4 times a year for internal eventsWhat we offer youWe consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus which varies based on seniority but starts at a range up to 10%. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to ensure fairness globally.Distributed work environment with twice-yearly team sprints in person - we've been working remotely since 2004!Personal learning and development budget of USD 2,000 per yearAnnual compensation reviewRecognition rewardsAnnual holiday leaveMaternity and paternity leaveEmployee Assistance ProgrammeOpportunity to travel to new locations to meet colleagues from your team and othersPriority Pass for travel and travel upgrades for long haul company eventsAbout CanonicalCanonical is a pioneering tech firm that is at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do.Canonical has been a remote-first company since its inception in 2004. Work at Canonical is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game. Canonical provides a unique window into the world of 21st-century digital business.Canonical is an equal opportunity employerWe are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.\n", "job_level": "Entry level", "job_program_type": "Contract", "job_category": "Human Resources", "job_activity_sector": "Technology, Information and Internet"},
{"job_url": "https://ro.linkedin.com/jobs/view/data-analyst-yardi-resident-screening-at-yardi-romania-3695974478?refId=E873y%2FHzfEZ3IECgwjuahw%3D%3D&trackingId=s3pWekWz9%2BrkgkmS%2BmmuOA%3D%3D&position=20&pageNum=0&trk=public_jobs_jserp-result_search-card", "job_title": "Data Analyst - Yardi Resident Screening", "job_company": "Yardi Romania", "job_nr_candidates": 0, "job_description": "\n        We're looking for a dedicated Data Analyst to be part of our Resident Screening Analytics team. Since 2010, Yardi Resident Screening has been focused on providing our clients with insightful analysis regarding their applicant pool and resident performance.As a part of our YRS Analytics team, you will work together with colleagues and supervisors on assigned projects to make sure internal management and client needs are met. You will be using statistical and visual analysis tools, and gathering and interpreting data, in order to offer clients a complex overview of applicant trends.This role implies both on-site and remote work, so please consider that you may occasionally be called to work from the Cluj office.What We're Looking ForBachelor's degree or higher in statistics, mathematics, or other related fields;Strong Microsoft Excel skills;+Statistical Analysis;+Data Mining;+Past experience in successfully handling projects that require accuracy and close attention to detail (preferably projects that involved large amounts of data within spreadsheet and database programs);+Ability to meet critical deadlines and prioritize multiple tasks in a fast-paced environment;+Strong attention to detail;+Independent decision-making and problem-solving skills;Effective communication skills in English, both written and spoken;+Ability to think analytically and effectively communicate analysis to others.It Is Considered a Plus+Database experience;+Experience with statistical or analytical tools;+Experience in using CRM.What You'll Do+Execute special data projects using statistical and visual analysis tools;+Gather and analyze data from various sources to determine and report on key observations, conclusions and trends;+Produce attractive charts, graphs and reports to communicate data findings to end users;+Analyze industry trends and incorporate industry data into analysis;+Present actionable information to optimize business decisions;+Research on market conditions and industry trends to incorporate into data sets;+Document processes as needed contributing to the analytics knowledge base;Make suggestions for improvements and additional value-added data projects.We Also Offer a Competitive Benefits Package IncludingHighly competitive salary;Up to two thousand USD educational reimbursement plan/calendar year;Comprehensive private medical and life insurance plan;Flexible work schedule;Modern technology, work methods and tools;Possibility to participate in various training programs and conferences;Thirty RON/day meal tickets;Frequent internal engagement activities, themed parties & team-buildings;Discount plans for fitness centers, restaurants and various service providers;Fresh fruit, snacks and coffee in the office;Open air terraces, game rooms.Company DetailsYardi Romania is part of Yardi Systems, Inc., an American company founded in 1984 that has become the leading provider of software solutions for the real estate industry, with over 45 offices and 8000+ employees worldwide. Our development center in Cluj-Napoca, opened in 2010, is the second largest Yardi office in the world – counting over 1,200 dedicated professionals with highly diverse skillsets, ranging from software development to data research and analysis, marketing, journalism, consulting, and customer service.Our success belongs to our employees, who make Yardi Romania an amazing place to work and grow.\n      ", "job_level": "Entry level", "job_program_type": "Full-time", "job_category": "Information Technology", "job_activity_sector": "Software Development"},
{"job_url": "https://ro.linkedin.com/jobs/view/hr-admin-assistant-cluj-remote-work-model-at-antal-international-3701313147?refId=E873y%2FHzfEZ3IECgwjuahw%3D%3D&trackingId=XWacpqIGBQezlotsMALVyA%3D%3D&position=19&pageNum=0&trk=public_jobs_jserp-result_search-card", "job_title": "HR Admin Assistant - CLUJ, remote work model", "job_company": "Antal International", "job_nr_candidates": "122", "job_description": "\nOur client is seeking a passionate HR professional, a dynamic individual that pays attention to details and has advanced multitasking skills, that will have the role of HR Assistant.      HR Assistant      The HR Assistant is responsible for supporting the HR function by maintaining all HR data and providing related analytics, as well as various other HR tasks. We are seeking a talented HR Assistant to join our dynamic team. If you're a creative problem solver, always seeking to develop and grow in the current role, a master when it comes to time management, and a real team player, this opportunity is perfect for you.       Key Responsibilities:    1.       Onboarding and Orientation:        Play a key role in welcoming new hires in the organization, offering support in all the dedicated onboarding activities of new employees (prepare onboarding, fix meetings, assist managers in welcoming new employees)          Track employee progress within the onboarding program (IT form, check list…), ensuring a smooth integration into the company’s culture and value         Create dedicated reports       2.       HR Administration:        Play a part in an international organization, offering support for the daily operations of HR team (International)         Use HR databases to review, input and keep track of employee information         Maintain organized, complete and up-to-date HR files in the ADP system         Maintain the ESS absence system accurate for all countries in Europe      3. Employee Relations:        Provide support in resolving employee queries, offer information regarding the HR processes          Be a point of contact for employees, have excellent written and verbal communication skills, with the ability to communicate effectively at all levels of the organization      Your profile:         Bachelor’s Degree in Human Resources or relevant fields         Minimum of 2-3 years' work experience in a similar role         A proven track recording of executing HR-related tasks         Hands on experience working with MS Office, and HR software / Database management         Effective oral and written communication skills in English, any other foreign language is a plus         High ethical standards and ability to exhibit a high level of confidentiality         Natural multitasker who can handle competing priorities and deadlines with ease         Attention to details, ability to accurately maintain data in the HR systems         Thrive in a team-oriented environment and actively contribute to the success of the HR team and the organization         Availability to travel        We are happy to consider applications from all candidates who are able to demonstrate the skills necessary to fulfill the role. We can only answer to the best-fit applicants. The rest of the CVs are stored in our international talent pool for potential future matches. Please note that your personal information will be treated in accordance with our Privacy Policy. Thank you!    By applying to this job, you give your written consent and agreement to Antal Romania/ Cluj-Napoca Office to keep your CV in our systems and to send it to our clients for evaluation as a candidate for the available positions in their organizations.    You are informed that your data will be kept according to Antal's Privacy Policy (https://www.antal.com/privacy).\n", "job_level": "Entry level", "job_program_type": "Full-time", "job_category": "Human Resources", "job_activity_sector": "Staffing and Recruiting"},
{"job_url": "https://ro.linkedin.com/jobs/view/sales-manager-romania-at-ratehawk-3590332759?refId=E873y%2FHzfEZ3IECgwjuahw%3D%3D&trackingId=yCnGPMmYNvF5vz3Oek2%2FCQ%3D%3D&position=18&pageNum=0&trk=public_jobs_jserp-result_search-card", "job_title": "Sales Manager Romania", "job_company": "RateHawk", "job_nr_candidates": "82", "job_description": "\nEmerging Travel Group, world leader in online travel services, a travel-tech company that owns several international brands: RateHawk, ZenHotels, RoundTrip, and others.12 years ago we exploded into the travel industry with an innovative B2B hotel booking engine. Today we have representatives in more than 40 countries around the world, giving our clients the ability to book travel services in any country.We are looking for an experienced Sales Manager in Romania to join our international B2B brand RateHawk, develop our business and make the travel world better together!Job ResponsibilitiesActively promote our international project in assigned territory;Develop and implement sales activities and hit the sales targets to achieve growth and expand presence in assigned territory;Sign-up new partners and provide them with extended training of our system;Initiate an API deals with the potential and existing partners;Build and maintain a strong, long-lasting relationship with new partners;Prepare, execute, and manage the commercial deals with the partners including the execution of required document flow and technical setup;Account clients until the first purchase is made;Control of compliance with commercial conditions by partners including the payment flow;Provide market & competitive environment analysis;Provide comprehensive reportingRequirements Relevant experience. Ideally, 2-5 years experience in the travel industry and excellent knowledge of the country`s travel market; specialized in sales management or business development of B2B travel companies;Competence in API technology deals; Personal skills. Proactive, ambitious, motivated, action-oriented, results-focused, appetite for innovative technology, comfortable with fast-changing business environment, teamplayer; Analytical skills. Used to data-driven decision-making, metrics-driven and good with numbers; International mindset. Ability to understand and work across a wide range of cultural contexts reflecting ETG’s global presence; Language knowledge. Fluent in Romanian and English, other languages as a plus; Readiness for business trips. 30 – 40% of working time might be required for market visitsBenefitsCompetitive salary;Career growth opportunities and a corporate culture that encourages professional development;Complex and innovative product;Young and ambitious team of professionals;Learning: seminars, trainings and conferences. If you want to participate in a conference, we will help to organize it;Remote work format and a flexible timetable — we don’t require you to be online or in the office at 09:00 sharp. You can start work at a time that suits you;Corporate discounts on hotels and other services\n", "job_level": "Mid-Senior level", "job_program_type": "Full-time", "job_category": "Sales", "job_activity_sector": "Technology, Information and Internet"},
{"job_url": "https://ro.linkedin.com/jobs/view/graphic-designer-keen-on-data-a-k-a-classic-with-a-twist-at-yardi-romania-3701250550?refId=E873y%2FHzfEZ3IECgwjuahw%3D%3D&trackingId=AcrgCxFZHHFeMs4Pu3iBZA%3D%3D&position=17&pageNum=0&trk=public_jobs_jserp-result_search-card", "job_title": "Graphic Designer keen on data (a.k.a. classic with a twist)", "job_company": "Yardi Romania", "job_nr_candidates": "39", "job_description": "\n        The classics: This position represents a great opportunity to get introduced to the highly competitive North American online marketing industry. Our dynamic marketing team in Cluj-Napoca, already counting over 120 professionals, is looking for a graphic professional to join them in taking on the real estate industry. Friendly, professional and fun are just some of the words people use to describe the work environment in the marketing team at Yardi.The twist: Out here, in the realm of marketing, we're good at what we do and we do wonders, but we need a graphic wizard to help us get our projects seen… and ok, reach their goal too (amaze or just convert, emphasize or just distract, convince or just impress, get the ok or get an honest wow!).The road from idea to goal is never straight. You and the team would have to cruise through the roads of great ideas and take things from A to an outstanding B. Up for the challenge?This role implies both on-site and remote work, so please consider that you may occasionally be called to work from the Cluj office.The ClassicsDesired skills and experience:2years of relevant work experience;A very good sense of colour, proportion and layout;Very good knowledge of graphic and multimedia software and applications such as Adobe Creative Suite (Illustrator, Photoshop, InDesign, Premier);Ability to transform the strategic intent into compelling design concepts;Ability to multitask and shift focus from one project to another;A high level of attention to detail;Strong interpersonal skills and ability to work in a cross-functional team;Good English skills.The TwistIf you can work on multiple assignments with good planning of your time and priorities, you're it.If you can understand structure, analyze data and put it in a comprehensive chart, you're even better.If you can challenge existing methodologies and identify alternative solutions, you're the best.If you've worked with data visualization tools like Infogram or Tableau, or any other for that matter, where have you been all our lives?ResponsibilitiesThe classics:Designing eye-catching PR materials based on in-house market reports;Suggesting new ideas for graphic output for the project;Being part of the project's artistic direction;Collaborating with all marketing specialists to deliver high quality creative material (concept to completion) that meet the objective;Maintaining overall consistency in graphic appearance according to the brand's standards and guidelines;Designing digital marketing materials and marketing collateral in collaboration with our marketing specialists (ads, banners, landing pages).The TwistWe need a passionate artist who understands that seeing every little bit of a project will make him/her create the best visual representation and only that very best outcome can bring the best results.Think of it like this: we have a full suite of digital marketers, from content creators to communications specialists, from analysts to email marketers, from search engine optimization experts to paid advertising specialists. They all need a designer's eye (and brain, and opinion and skill).Mandatory task: Please submit your portfolio through the application form or include a link on your resume.We Also Offer a Competitive Benefits Package IncludingHighly competitive salary;Up to two thousand dollars educational reimbursement plan/calendar year;Comprehensive private medical and life insurance plan;Flexible office work schedule;Modern technology, work methods and tools;Possibility to participate in various training programs and conferences;Thirty RON/day meal tickets;Frequent internal engagement activities, themed parties & team-buildings.Discount plans for fitness centers, restaurants, and various other service providers;Fresh fruit, snacks and coffee in the office;Open air terraces, game rooms.Company DetailsYardi Romania is part of Yardi Systems, Inc., an American company founded in 1984 that has become the leading provider of software solutions for the real estate industry, with over 45 offices and 8000+ employees worldwide. Our development center in Cluj-Napoca, opened in, is the second largest Yardi office in the world – counting over 1200 dedicated professionals with highly diverse skillsets, ranging from software development to data research and analysis, marketing, journalism, consulting, and customer service.Our success belongs to our employees, who make Yardi Romania an amazing place to work and grow.\n      ", "job_level": "Entry level", "job_program_type": "Full-time", "job_category": "Design, Art/Creative, and Information Technology", "job_activity_sector": "Software Development"},
{"job_url": "https://ro.linkedin.com/jobs/view/junior-developer-dubai-uae-at-cobblestone-energy-3642302640?refId=E873y%2FHzfEZ3IECgwjuahw%3D%3D&trackingId=BSg9B56HF30kEBQAc522Ew%3D%3D&position=16&pageNum=0&trk=public_jobs_jserp-result_search-card", "job_title": "JUNIOR DEVELOPER - Dubai, UAE", "job_company": "Cobblestone Energy", "job_nr_candidates": "67", "job_description": "\n        Starting salary of 60,000 USD per annum in a zero-tax environment.Fast progression for strong performers.Job location: Dubai, UAEAbout us:Cobblestone Energy is a proprietary trading firm that specializes in the wholesale electricity market across Europe. Electricity is fundamental to the world's economic activities. We trade enough electricity every day to power a small country, and in doing so, we help to address the mismatch between electricity generation and consumption.Job Description At Cobblestone Energy we are on a mission to build the most advanced European electricity trading and analytics platform, with our technology being used by our teams of commercial traders to create significant value. We are looking for enthusiastic and resourceful developers who are passionate about building exceptionally reliable and performance data processing solutions. You want to help the commercial team make data-informed decisions, have a curious mindset, and are motivated to understand our business better. Developing a strong domain knowledge of our industry over time is key to long term success in this role. If you have excellent programming skills, strong problem-solving skills, and a passion for developing and improving applications utilizing cutting edge technologies, then we would like to meet you. What we offer in this role Competitive remuneration, with fast progression for strong performers. A challenging but exciting, open, and fun work environment. An opportunity to work with remarkably talented colleagues. Vast growth potential in every aspect. 15% target bonus with further upside. Employee share scheme participation International relocation support Opportunity to be embedded within a commercial team for those with strong commercial interest Responsibilities Write software applications and programs for backend/frontend purposes.  Analyse programs and apps to improve their features and functionalities.  Test & debug programs and fix any reported bugs.  Collaborate with the tech team to improve the performance, efficiency, and scalability of our tools.  Requirements BS/BE in Computer Science/Computer Engineering.  Programming experience of 1 to 2 years in Python language.  Expertise in at least one popular Python framework (like Django, Flask ...).  Experience of 1 to 2 years in front-end technologies such as HTML5, CSS, JQuery, JS, ...etc.  Knowledge of APIs and webservices.  Knowledge of Relational Databases (MySQL, PostgreSQL, SQL Server ...) and SQL language.  Knowledge of NoSQL databases is a plus.  Knowledge of AWS is a plus / Knowledge of data visualization tools, mainly Tableau, is a plus.  Ability to work in a team environment.  Strong problem-solving skills and analytical skills.  Resilience and a determination to succeed.  Independent thinkers with growth mindset.  Must be passionate, self-motivated, and able to learn quickly.  Strong sense of integrity.   Personal values that match our company values. \n", "job_level": "Entry level", "job_program_type": "Full-time", "job_category": "Engineering and Information Technology", "job_activity_sector": "Technology, Information and Internet"},
{"job_url": "https://ro.linkedin.com/jobs/view/campaign-online-sales-manager-at-hustler-marketing-3698159108?refId=E873y%2FHzfEZ3IECgwjuahw%3D%3D&trackingId=h7lR62uHjoJu%2Fm1DAKDspA%3D%3D&position=15&pageNum=0&trk=public_jobs_jserp-result_search-card", "job_title": "Campaign & Online Sales Manager", "job_company": "Hustler Marketing", "job_nr_candidates": 0, "job_description": "\nAt SWATI, we celebrate style and beauty in all its forms. Not only do we provide our customers with exceptional beauty solutions, but we encourage people to express who they are. As an official partner of Sephora, Douglas, Kicks, and Nykaa, we are proud to offer our products to people all over the world, including over a million followers on our platforms.We are a Swedish-based company with Scandinavian values. Equality, empowerment, and self-expression are at the heart of everything we do — and you are a part of it. When it comes to our team, we follow through on our mission. That’s why we work so hard to foster a work environment that is truly exceptional. As a team, we value collaboration, creativity, and growth. As part of SWATI, you’ll be joining a place where your ideas are valued, your voice is heard, and your contributions have a real impact. About the Role:The Campaign & Online Sales Manager at SWATI is responsible for the management of our brand’s marketing campaigns and online sales. This position requires a deep understanding of digital marketing, e-commerce, online sales, and the analytics that go hand-in-hand with these aspects.Regarding marketing campaign management, this involves playing a key role in ensuring that our campaigns are created, optimized, and executed in a way that drives sales, with a focus on seamless management and timely delivery. Regarding online sales management, the Campaign & Online Sales Manager is required to take full ownership of managing SWATI’s online sales, while overseeing processes and initiatives that contribute to achieving our company's sales goals. Since SWATI is a sales-intensive company, it’s important to have a good understanding of our competitors, our peak sales seasons, what constitutes good offers for our customers, and staying up to date on industry trends.Responsibilities generally include managing our marketing campaigns from inception to completion, compiling reports on SWATI’s marketing efforts, tracking online sales, compiling sales reports with analytical insights, managing campaign and sales systems and processes, as well as delegating tasks to other team members as it pertains to campaign and online sales management.General responsibilities:The responsibilities of our Campaign & Online Sales Manager include, but are not limited to:Managing and optimizing SWATI’s yearly sales and campaign calendarMaintaining a thorough understanding of our market competitors and sales seasonsContinuously working to identify the most effective offers for each month, week, and holidayRegularly optimizing all internal and external processes related to marketing campaigns and online sales in an effort to help SWATI reach its overall sales goalsDriving marketing campaigns from the creation of ideas through to the execution, including delegating and overseeing the creative work to ensure that the campaigns provide the best possible outcomes for SWATI and align with our brand identityTracking and analyzing campaign and sales performance metrics (such as conversion rates, open rates, click-through rates, and revenue growth) from various channels like Google Analytics, Shopify, Klaviyo, SMS, and WhatsAppProviding valuable feedback to our internal and external marketing teams and partners to optimize campaigns and sales (including information on the number and value of orders received)Keeping track of SWATI’s online sales with regular reporting and actionable analytical insightsBeing familiar with current market and beauty trends and constantly optimizing the SWATI’s sales and campaign calendar accordinglyRegularly review and summarize campaign performance, highlighting successes, areas for improvement, and optimization opportunities to achieve maximum ROIOverseeing processes and initiatives that contribute to achieving our company's sales goalsDriving the internal team and outside vendors to improve sales and campaign performanceKeeping track of the use of discounts from emails, SMSs, influencers, and moreBeing a reliable point of contact between SWATI and marketing vendors, including email marketing agencies, paid social media agencies, SEM agencies, and CRO agencies (including taking calls, attending virtual meetings and coordinating between teams)Overall, the Campaign & Online Sales Manager will play a pivotal role in driving the success of SWATI's marketing campaigns and online sales efforts (whether internal or external), contributing to the company's growth and the achievement of the company’s sales goals.RequirementsPosition specifications:The Campaign & Online Sales Manager position includes committing to the following:Full-time commitment while meeting our general availability for office hours (11:00AM - 8:00PM Gulf Standard Time)Consistently maintain a record of 160 tracked hours per monthFixed-rate monthly salary paid in USDReceive contractor status after signing our non-disclosure agreementCommitting to a 45-day notice period after 3 monthsAbout You:The Campaign & Online Sales Manager needs to take a strong, innovative, and pioneering approach to their work. You should be able to work independently with high levels of reliability, transparency, and trust. In addition, you need to be a highly analytical person with the ability to work under pressure, manage multiple projects and systems, and efficiently coordinate work with various partners and teams.The ideal person for this role is a dedicated, detail-oriented team player with excellent planning, communication, time management, and organizational skills. In addition, you need to be dedicated to planning, pushing, and running your own workday to propel SWATI toward its sales objectives.You should also feel comfortable working in a remote environment. Availability and consistency are highly important factors for us, so the Campaign & Online Sales Manager should display these qualities when it comes to workload commitments and general availability during office hours.Key requirements:The Campaign & Online Sales Manager position has the following key requirements:Previous experience in an e-commerce or agency environment is a mustPrevious experience in a similar role within the e-commerce industry is highly desirablePassion for utilizing dashboards and maintaining control over campaign outcomesIn-depth knowledge of e-commerce principles, strategies, and industry trends (including the trends and best practices of SWATI’s beauty niche)Excellent proficiency in Google Analytics, Klaviyo, Shopify, Slack, WhatsApp, Excel, Google Workspace, and other relevant toolsAbility to manage the campaign and sales workflow and delegate tasks to other team membersAbility to lead a team and assist with SWATI’s recruitment initiatives when requiredA pioneering, innovative, and creative approach to your workA thorough understanding of our market competitors, and sales seasons, and the ability to identify the most effective offers for each month, week, and holidayHigh levels of responsibility to ensure that all reporting, tracking, and sales data is in alignment with SWATI’s company budget, financial forecasts, and goalsAbility to work with analytical dashboards and provide insights on the outcomes of campaigns and sales initiatives, and the ability to find ways to improve the resultsAbility to work with, understand, and use sales and campaign statistics to summarize the successes, weaknesses, and opportunities for improvementA dedication to how SWATI’s sales and campaigns are performingAbility to work in a start-up B2C environmentFamiliarity with working autonomously and managing your own time independently and effectively (remote work experience is a plus)Must have a stable internet connection and a laptop or PC, as well as be able to attend virtual video conferencesExcellent verbal and written communication skills in English. You must be fluent in English, although English doesn't have to be your native languageBeing open to receiving feedback and constructive criticism and improving on it, as well as giving feedback of a similar nature productively to your teamMust be available and responsive during SWATI’s office hours (which are from 11:00 AM to 8:00 PM Gulf Standard Time)Must be able to consistently work full-time\n", "job_level": "Mid-Senior level", "job_program_type": "Full-time", "job_category": "Marketing", "job_activity_sector": "Technology, Information and Internet"},
{"job_url": "https://ro.linkedin.com/jobs/view/data-scientist-at-tractable-3698331241?refId=E873y%2FHzfEZ3IECgwjuahw%3D%3D&trackingId=RJCY2npdxXHao3IGVmEkdg%3D%3D&position=14&pageNum=0&trk=public_jobs_jserp-result_search-card", "job_title": "Data Scientist", "job_company": "Tractable", "job_nr_candidates": "39", "job_description": "\nWho we are:Tractable is an Artificial Intelligence company bringing the speed and insight of Applied AI to visual assessment. Trained on millions of data points, our AI-powered solutions connect everyone involved in insurance, repairs, and sales of homes and cars – helping people work faster and smarter, while reducing friction and waste.Founded in 2014, Tractable is now the AI tool of choice for world-leading insurance and automotive companies. Our solutions unlock the potential of Applied AI to transform the whole recovery ecosystem, from assessing damage and accelerating claims and repairs to recycling parts. They help make response to recovery up to ten times faster – even after full-scale disasters like floods and hurricanes.Tractable has a world-class culture, backed up by our team, making us a global employer of choice!We're a diverse team, uniting individuals of over 40 different nationalities and from varied backgrounds, with machine learning researchers and motor engineers collaborating together on a daily basis. We empower each team member to have tangible impact and grow their own scope by intentionally building a culture centred around collaboration, transparency, autonomy and continuous learning.Please note that this is a 4 month contract engagement. You must be based in RomaniaEngineering @ TractableThe engineering team at Tractable plays a key part in bringing our AI to life. The way we build our product is by putting a team together with all the skills and context it needs to be able to solve real world problems. We believe strongly in cross functional teams and collaboration. This means you will be working alongside software engineers, machine learning engineers, data scientists and product managers and designers. You will be working out how we can best help thousands of people around the world recover faster from an accident. We’re proud to see our products have a massive impact on the insurance market daily… and we know this is just the beginning.The role:You will be joining the Customer AI Engineering team. CAIE works directly with our business development, product and AI research teams to provide a comprehensive solution to our customers’ business problems. We continuously learn how to best achieve our mission: we make the best of feedback and experiences brought in by everyone and we look forward to hearing about what you can bring.What you will be working on:Evaluate and fine-tune our machine learning models using statistical techniquesWork at a key intersection between customers, AI researchers, product engineering teams, and business developmentPartner cross-functionally with product managers, core platform engineers, and AI researchers to onboard customers onto our platformBuild modules that help onboard new customers onto our AI platformWhat you need to be successful;Familiarity with Python and canonical data science libraries (numpy, pandas, scikit-learn)Good background in applying data science and statistics fundamentals in industry settingExperience in one or more of the following: data cleaning, feature engineering, data visualisation, metric selection and requirements extractionAbility to manage a complex technical project involving multiple stakeholdersExcellent communication and interpersonal skillsAbility to work independently and effectively in a dynamic environment\n", "job_level": "Mid-Senior level", "job_program_type": "Contract", "job_category": "Information Technology", "job_activity_sector": "IT Services and IT Consulting"},
{"job_url": "https://ro.linkedin.com/jobs/view/qa-engineer-at-finshape-3696355989?refId=E873y%2FHzfEZ3IECgwjuahw%3D%3D&trackingId=r9vnGZwBZ44IfP0T0tK23Q%3D%3D&position=13&pageNum=0&trk=public_jobs_jserp-result_search-card", "job_title": "QA Engineer", "job_company": "Finshape", "job_nr_candidates": "96", "job_description": "\nCompany DescriptionFinshape blends digital banking platform and deep personalisation capabilities into a driver of digital success for banks in Europe and the MENA region.We believe that the path forward for financial institutions is shifting to seamless, personalised, data-driven experiences, which will lead to better outcomes both for them and their customers. But when it comes to digitalisation technology is only half the story. This is why our purpose is twofold: to build products that work and to help banks make the most of them, from set-up to fine-tuning.Job DescriptionWe are now looking for a QA Engineer to join our team and contribute to the enhancement of our customer-centric digital banking platform whose primary goal is to transform/bridge exceptional customer experience to the organization’s effective business operations.QualificationsKnowledge of testing principles and methodologies;Experience with testing throughout the entire software development life cycle and writing bug reports;Experience in manual cross-platform testing (Web, Android, iOS);Experience using Jira, JenkinsAdditional InformationA talented team where everyone loves what they doSalary commensurate with knowledge and experienceTraining opportunities to keep you aheadFringe benefitsFlexible working hours, because we understand that creativity doesn’t always operate on a 9-to-5 scheduleWe have an office in Cluj-Napoca, for the days you feel like socializing with your colleaguesWant to revolutionise digital banking one insight at a time? Let’s have a chat and see how you can add value to our team!\n      ", "job_level": "Mid-Senior level", "job_program_type": "Full-time", "job_category": "Engineering and Information Technology", "job_activity_sector": "Software Development"},
{"job_url": "https://ro.linkedin.com/jobs/view/ai-system-architect-at-e-infra-3667173675?refId=E873y%2FHzfEZ3IECgwjuahw%3D%3D&trackingId=OiwsUTCxCTLkDbaS0i%2FDEg%3D%3D&position=12&pageNum=0&trk=public_jobs_jserp-result_search-card", "job_title": "AI System Architect", "job_company": "E-INFRA", "job_nr_candidates": 0, "job_description": "\nIdeal candidate:A bachelor's or master's degree or certificates in computer science, artificial intelligence, or a related field is a must. Relevant work experience in AI system development, software engineering, or system architecture is highly valued.Solid understanding of various AI techniques, such as machine learning, deep learning, natural language processing, and computer vision. Must be familiar with different AI frameworks, libraries, and tools.Strong programming skills are essential, particularly in languages commonly used in AI development, such as Python, Java, or C++. Knowledge of other languages, such as R or MATLAB, can also be beneficial.AI system architects should be familiar with popular AI technologies and frameworks, such as TensorFlow, PyTorch, Keras, or scikit-learn. They should have hands-on experience in implementing AI models and systems using these tools.A deep understanding of system design principles, architecture patterns, and software engineering best practices is crucial. Knowledge of data management and processing techniques, including data ingestion, storage, preprocessing, and integration. Familiarity with big data technologies like Hadoop, Spark, or distributed computing frameworks is advantageous.Experience with cloud platforms, such as Amazon Web Services (AWS), Microsoft Azure, or Google Cloud Platform, is important. Strong problem-solving abilities and analytical thinking are crucial for an AI system architect. Effective communication skills are essential.Good to know : Power Automate, Power Apps and MsSQL optimization.Responsibilities:The role of an AI system architect involves designing and developing the architecture and infrastructure for AI systems. AI system architects should be able to design scalable, efficient, and robust AI systems that meet the requirements of the specific use cases.AI system architects should be capable of deploying AI systems on the cloud, managing cloud resources, and optimizing performance and cost-efficiency.Must be able to identify and address technical challenges, optimize system performance, and make informed decisions based on data and analysis.Collaborate with cross-functional teams, including data scientists, software engineers, and stakeholders. Should be able to communicate complex technical concepts and ideas clearly and concisely.Given the rapid advancements in AI technologies, AI system architects should be proactive in staying updated with the latest trends, research, and industry developments. You should have a passion for learning and be willing to adapt to new tools and techniques.Our IT department is committed to providing support to all group companies, especially during times when the tasks and demands are not excessively demanding.Powered by JazzHRzeuZDhmZmp\n      ", "job_level": "Mid-Senior level", "job_program_type": "Full-time", "job_category": "Engineering and Information Technology", "job_activity_sector": "Internet Publishing"},
{"job_url": "https://ro.linkedin.com/jobs/view/data-engineer-at-tecknoworks-3689679505?refId=E873y%2FHzfEZ3IECgwjuahw%3D%3D&trackingId=COqnwQcnkGVohXURyuYr8g%3D%3D&position=11&pageNum=0&trk=public_jobs_jserp-result_search-card", "job_title": "Data Engineer", "job_company": "Tecknoworks", "job_nr_candidates": "158", "job_description": "\nTecknoworks is a global technology consulting company. At our core, we embody values that define who we are and how we operate. We are curious, continuously seeking to expand our understanding and question conventional wisdom. Fearlessness drives us, propelling us to take daring steps to achieve significant outcomes. Our aspiration to be inspiring motivates us to consistently reach for our personal and collective best, setting an example for ourselves and those we interact with. Collaboration is our strength, capitalizing on the diverse brilliance within our team. Our commitment knows no bounds; we consistently go the extra mile to ensure enduring positive effects for our clients.Ready to engineer the future of data? Join us in shaping tomorrow's insights. Elevate your career as a Data Engineer with us and be part of a dynamic team that's pushing boundaries, solving challenges, and transforming data into actionable intelligence.Apply now to drive innovation and lead the way in data-driven excellence!Location: Romania (Remote)Contract type: EmploymentKey Responsibilities:Support data migration strategies to facilitate data transfer from diverse sources to the target platform. Collaborate with cross-functional teams to gather data requirements and understand the data structure, ensuring data accuracy and completeness throughout the migration process. Maintain ETL workflows and pipelines using tools and other data processing technologies (e.g.: SSIS, Snowflake, Azure Synapse/Fabric/ADF, Databricks, etc.). Conduct validation of data migration procedures to guarantee data integrity and minimize downtime during the migration process. Optimize data migration processes to enhance performance, scalability, and efficiency. Troubleshoot and resolve issues related to data migration, ensuring a smooth and error-free migration. Provide technical support and guidance to stakeholders during and after migration. Stay up to date with industry trends, best practices, and advancements in data migration and ETL technologies. Key Skillset Required:Proficient in SQL, able to write complex queries and optimize data retrieval. Familiarity with the target platform of migration (e.g., Snowflake, Databricks, Azure Synapse, Apache Hadoop), though expert-level knowledge is optional. Hands-on experience with data processing tools, and a good understanding of ETL processes & methodologies. General ETL capabilities and experience, irrespective of the tools used. Strong analytical and problem-solving skills with acute attention to detail. Excellent communication skills and the ability to work collaboratively in a team environment. Proven record of successful data projects (ETL) and/or migration projects. Preferred Qualifications:Bachelor's degree in computer science, Data Engineering, or a related field. Previous experience with cloud-based data ETL solutions (e.g., Synapse/Azure Data Factory, Data Bricks, Snowflake) would be advantageous. Certification in relevant data engineering and ETL methodologies is a plusJoin our team and be part of an innovative organization that leverages data to make informed business decisions. As a Data Engineer with expertise in data migration, you will have the opportunity to contribute to critical projects and play a vital role in shaping our data infrastructure.We would love to hear from you if you are a highly motivated individual passionate about data engineering and migration.\n      ", "job_level": "Mid-Senior level", "job_program_type": "Full-time", "job_category": "Analyst", "job_activity_sector": "Technology, Information and Internet"},
{"job_url": "https://ro.linkedin.com/jobs/view/data-scientist-at-winnow-3710028101?refId=E873y%2FHzfEZ3IECgwjuahw%3D%3D&trackingId=jF3lzNEYw%2FWNPCqiMTDAog%3D%3D&position=10&pageNum=0&trk=public_jobs_jserp-result_search-card", "job_title": "Data Scientist", "job_company": "Winnow", "job_nr_candidates": 0, "job_description": "\nABOUT USFood waste is a $1 trillion problem - costing the world over 1% of global GDP. We're dead set on solving the problem and looking for people to help us achieve our mission. We, at Winnow, believe that food is far too valuable to waste, and that technology can transform the way we produce food. Our team is made of people who all share a passion for food and technology.Winnow was founded in London in 2013 to help the hospitality industry prevent food waste through internet of things tools in the kitchen. We have worked with hundreds of sites and are operating in over 25 countries around the world supported by our offices in London, Dubai, Shanghai and Singapore. We are a rapidly growing company with a strong base of clients who are rolling out our system globally. We have blue-chip customers including Accor Hotels, IKEA, IHG, Marriott, Compass Group and many others.As the global leader in addressing food waste, we are committed to continue pushing the envelope on what technology can do to solve this problem. Winnow Vision, our new artificial intelligence-based technology, is trained to automatically track all food waste thrown away. It has won awards at the World Economic Forum and has been received tremendous enthusiasm from our clients and the industry. You can read more about it on our website and this article in Forbes.Other recent accolades saw Winnow awarded a winner of Impact 50's most impactful companies to work for. You can read more about it here.We are passionate about living our values and place them at the centre of everything we do.THE ROLEAbout the teamThe Data team plays a critical role in the continuous improvement of our flagship product - Winnow Vision. We've collected millions of images of food items already, and keep collecting thousands every day from the kitchens we operate in. Those images need to be processed, curated and structured to optimise the quality and accuracy of our AI models. Managing this big data pipeline is no easy task: we operate across the world, in a wide variety of industries and our model needs to recognize food ranging from the Malay Nasi Goreng to the American fried chicken, and everything else in between.We have come a long way - from long data collection time and training small AI models for very specific clients, we have now managed to generalise our approach and can now deploy AI models to almost any kitchen in the world in a matter of a couple of weeks. However, there are still many challenges ahead - today we present a top selection of items to our clients and they confirm the right one - our ambition is to become completely touchless. How can we make our models more confident and more accurate, that is the question!The Data & Machine Learning team consists of 7 people (2 in Cluj and 5 in London) and is expected to continue to grow in the coming months. Roles currently range from data operation to data science.We are investing in developing new products and services, and this role is responsible for supporting data analysis for these innovations. About the role:As a Data Scientist, you will be reporting to the Data Science Lead and will have a wide range of responsibilities which includes: Use your data skills to enhance the confidence and accuracy for our AI models Developing and refining complex queries and reports to help other team members execute their roles Performing ongoing data analysis to present back insights to clients Shape our data      processes to optimize efficiency while reducing costs Imagine and deliver      insightful analysis aiming at improving our user experience Monitor and manage      the existing fleet of models in the field, and ensure new clients benefit      from AI no less than 1 month after installation Produce and track key performance indicators Take on more complex data analysis problems RequirementsExcellent numerical and analytical skills Solid knowledge in SQL, Python (pandas library particularly) required, with a willingness to learn more Experience with data formatting and cleaning, both for numeric and qualitative data Experience handling large datasets from 1,000s to 100,000s of rows Experience visualising large datasets Experience with Mode Analytics, JupyterHub, postgreSQL is a plus A willingness to learn and suggest machine learning approaches to solving data problems  Effective verbal and written communication skills Ability to adapt communication style to suit different audiences  Ability to facilitate group discussions Attention to detail. Ability to develop accurate written materials Action oriented. Ability to follow-up on feedback to ensure positive outcomes Ability to turn data into insights and present these insights effectively  Pro-active and critical thinker Ability to think out of the box and not afraid to speak up Ability to create new processes from scratch Ability to influence others to follow best practices Flexible and willing to take on new challenges as they emerge Benefits Competitive base salary Life insurance Company part-funded health insurance Meal tickets - 35 Ron per working day 2 Wellness hours per month, plus a 274 RON gross monthly wellness allowance Employee Assistance Programme - 24/7 helpline for your wellbeing 25 days of paid vacation time in addition to national holidays You will love what you do - waking up every day solving one of the biggest social problems of our generation Committed team members with broad experience who share a common passion to build a world class business\n", "job_level": "Entry level", "job_program_type": "Full-time", "job_category": "Engineering and Information Technology", "job_activity_sector": "IT Services and IT Consulting"},
{"job_url": "https://ro.linkedin.com/jobs/view/junior-project-manager-romania-at-new-era-technology-3641780113?refId=E873y%2FHzfEZ3IECgwjuahw%3D%3D&trackingId=eBRXBxvIxAGfTfUV%2B%2BrSoQ%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card", "job_title": "Junior Project Manager, Romania", "job_company": "New Era Technology", "job_nr_candidates": "191", "job_description": "\nNew Era Technology is a global technology solutions provider with 4,500+ employees and offices around the world. New Era offers Cloud, Managed, Professional, and Security services, and delivers Collaboration, Data Networking, Digital Transformation, and Physical & Life Safety solutions to more than 14,500 customers worldwide.We are looking for team members to contribute to and deliver our mission: \"To deliver and support technology solutions that securely connect people, places, and information.\" New Era Technology is a community of like-minded, like-hearted people who share the same vision and values.Work alongside the finest team of highly skilled and industry-certified professionals who are encouraged to drive change and think outside of the box. As a team member, you will receive competitive benefits, industry training, and certifications. New Era Technology empowers businesses to embrace the future workplace. As customers shift their perspectives on where and how work happens, we are there to meet them with flexible, resilient, and productive solutions.New Era Technology provides a team-oriented culture, a positive environment filled with an incredible staff, and a genuine passion for providing the best service to our customers worldwide. We believe that investing in our employees is the key to professional growth, delivering exceptional experiences for our customers, and setting the standard for excellence in our field.We offer a growth-orientated, high-tech environment for employees. Along with our many benefits, you can expect a corporate culture that promotes personal and professional development. Our customer-focused teams are built on our core values: Community, Integrity, Agile, and Committed.The Project Coordinator will efficiently assist all project activities to complete goals and deadlines established in relationship with the client.Responsibilities:Assists the Project Manager in project management- specific activitiesSummarizes all necessary documents to prepare reporting documentationPrepares project implementation from administrative point of viewKeeps in touch with the project implementation team, plans and monitors activitiesEnsures communication between project manager and implementation teamTakes measures so that the project spcific activities happen and the established goals are met. Performs assigned duties while respecting the quality parametres established by company policiesInforms the direct manager about any problems that affect their jobEnsures continuous professional growthKeeps confidentiality over information within job/companyRequirements:A minimum of 1 year working experience, ideally in Project ManagementBasic understanding of network related hardware and infrastructureExperience with a Ticketing SystemSelf-motivated, strong work ethic, results driven. Highly effective communicator (written & verbal). Good command of Microsoft Office SuiteFluent written and spoken communication skills in EnglishCapable of multi-tasking and task trackingAbility to establish and maintain strong relationships on different levels in the organizationMust be a team player and able to work collaboratively with and through others\n", "job_level": "Entry level", "job_program_type": "Full-time", "job_category": "Project Management and Information Technology", "job_activity_sector": "Technology, Information and Internet"},
{"job_url": "https://ro.linkedin.com/jobs/view/junior-analyst-dubai-uae-at-cobblestone-energy-3666531830?refId=E873y%2FHzfEZ3IECgwjuahw%3D%3D&trackingId=82DLYNV13%2FjgzKpS4xzytQ%3D%3D&position=8&pageNum=0&trk=public_jobs_jserp-result_search-card", "job_title": "JUNIOR ANALYST - Dubai, UAE", "job_company": "Cobblestone Energy", "job_nr_candidates": "29", "job_description": "\nEmployment type: Full-time & PermanentStarting salary of USD 60,000 per annum - 0% tax environmentJob Location: Dubai, UAE (We provide visa sponsorship & relocation assistance)About Cobblestone EnergyCobblestone Energy is an energy trading company specialising in the Great Britain and European wholesale electricity markets. Founded in 2017, we are part of the next generation of companies defining the future of global commodity trading.We make use of advanced data analytics and extensive research to drive profitable decision making, trading enough electricity every day to power a small country, and growing every day. In doing so, we help to balance the electricity grid, lowering the cost to end consumers, and aiding the transition to a renewable future. Technology and risk management form the backbone of our business.At Cobblestone Energy, we are a diverse team of over 50 people from 20+ nationalities - we believe in hiring extraordinary talent from all around the world. Our flat organizational structure helps us in giving our team members complete ownership of the work and ensures ideas come from every level. We believe in providing unlimited growth opportunities to our people alongside constant feedback and support, which allows us to cover our vulnerabilities and grow as a team in new and interesting ways. With the right performance and potential, you could be managing the power desk for an entire country within eighteen months in your role. Come join our dream team!Cobblestone ValuesLifelong learning with continuous reflection Independent thinking through a meritocracy of ideas The team is more important than the individual Being the best in any market we enter Hiring and keeping only the most effective people Others must benefit from our existence What We Offer In This RoleA full-time position on our Commercial team Committed and remarkably talented colleagues Highly competitive compensation dependent on performance An exciting, challenging and fulfilling career Investment in your development to ensure that you always remain the best in business Equity participation for strong contributors, ensuring our interests are all aligned long term ResponsibilitiesDeveloping new trading tools, strategies and improve existing ones Conducting fundamental research & analysis using Python Working hand in hand with the tech team to implement new business ideas Spearheading entry into new markets/ fields Upholding and living our cultural values Basic QualificationsExcellent numerical and logical reasoning skills Ability to think clearly in critical situations Passion, resilience, and integrity Preferred Qualification & BackgroundWe look for individuals from strong numerical backgrounds as such skills carry over well for excelling as a Junior Analyst. However, we welcome applicants from all backgrounds and experiences with a track record of excellence, both inside and outside of academics.The Hiring ProcessAfter your application is evaluated, assessments will include psychometric tests, a trading simulation, research project and remote interviews. All the finalists will then be invited for final round of the recruitment process which is a one-week training program, the Commercial Training Program (CTP), at our Dubai office. We will cater for all relocation costs, including flights, tickets, accommodation, work visa paperwork, and related expenses. Those who pass the CTP will be offered a full-time role at Cobblestone Energy and join our 7-12 month long Commercial Development Programme (CDP).The CDP is a well-structured rotational programme giving you exposure to both trading and analytics. In the CDP, you will work alongside our seasoned commercial team members, who will mentor you on the market fundamentals to help you develop potent trading and analytical skills.\n      ", "job_level": "Entry level", "job_program_type": "Full-time", "job_category": "Business Development and Sales", "job_activity_sector": "Technology, Information and Internet"},
{"job_url": "https://ro.linkedin.com/jobs/view/marketing-data-analyst-at-rws-group-3708597284?refId=E873y%2FHzfEZ3IECgwjuahw%3D%3D&trackingId=bMTkxJhaBxzXBlfzNEh%2FnQ%3D%3D&position=7&pageNum=0&trk=public_jobs_jserp-result_search-card", "job_title": "Marketing Data Analyst", "job_company": "RWS Group", "job_nr_candidates": 0, "job_description": "\nAbout The Role:An exciting opportunity to join our marketing operations team and drive data-led change and innovation.  The Marketing Analyst will deliver an effective and high quality marketing reporting service to the demand generation, campaign, and product marketing teams. They will work cross-functionally with the Business Intelligence, CRM, and Digital Experience teams to achieve marketing’s analytical goals. This role reports to a UK-based Marketing Analytics Manager but may interact with stakeholders worldwide. Applicants will therefore require strong verbal and written English skills. Occasional travel to meet team members is a possibility.Responsibilities: · Design, develop, model, and create data structures to integrate, prepare, and generate reports · Develop and build dashboards and visualizations in Sisense or similar BI tools· Identify performance, visualization and reporting challenges, and suggest code and architecture improvements · Breakdown requirements, simplify architectures, and collaborate with other business teams to deliver intelligent data solutions in line with defined objectives and results· Provide analysis of multi-platform campaigns, and develop crucial insight to enable marketing teams to optimize campaigns and drive success · Build relationships with the marketing team in order to understand business challenges and requirements for projects Requirements / Knowledge, Skills & Abilities:· Excellent communication skills and the ability to interpret stakeholder needs into technical requirements · Analytical aptitude and interest in interrogating data to develop hypotheses and insights. · Practical business experience with a visualization tool like Sisense (preferred), PowerBI, Tableau or Qlik · SQL skills · Knowledge of marketing platforms (Salesforce/ Hubspot/Google Analytics) and KPIs (AQL/pipeline/attribution reporting) are beneficial· Excellent attention to detail and high standards of presentation, especially in relation to written work · Proactive and forward thinking RWS is an Equal Opportunity.  We continually look to further expand and demonstrate the prominent role diversity and inclusion play in our culture, with emphasis on ways in which we hire and create work environments where employees from diverse communities can grow, develop and thrive. Qualified applicants will be evaluated for employment without regard to race, color, religion, sex, national origin, veteran, and disability status.To all recruitment agencies: RWS Group PLC does not accept agency resumes. Please do not forward any unsolicited resumes to any RWS employees. Any unsolicited resume received will be treated as the property of RWS and Terms & Conditions associated with the use of such resume will be considered null and void.\n", "job_level": "Associate", "job_program_type": "Full-time", "job_category": "Engineering", "job_activity_sector": "Translation and Localization"},
{"job_url": "https://ro.linkedin.com/jobs/view/international-regional-manager-romania-at-massive-bio-3703205400?refId=E873y%2FHzfEZ3IECgwjuahw%3D%3D&trackingId=VGboxDKGs2ZkNJKv1EYNCg%3D%3D&position=6&pageNum=0&trk=public_jobs_jserp-result_search-card", "job_title": "International Regional Manager - Romania", "job_company": "Massive Bio", "job_nr_candidates": "74", "job_description": "\n        Massive Bio is a rapidly growing health-tech startup founded in 2015 to provide every cancer patient with access to clinical trials regardless of their location or financial stability. Our proprietary patient recruitment and enrollment enablement solution for oncology clinical trials solves every friction point in traditional clinical trial enrollment. Privately held and headquartered in NY City, our passionate changemaker team is looking for an International Regional Manager to join our team in Romania. As a member of the business development team, the Regional Manager will be key to focus on Massive Bio's clinical trial enrollment services and the development of Massive Bio's growth efforts in all markets. The ideal candidate will have experience in Biotech/Pharma and the healthcare environment.Reporting to the Director of International Partnerships, you will:Handpick your dream team! Partner strategically with top-tier physicians, state-of-the-art hospitals, innovative CROs, and trailblazing health systems. Make them part of Massive Bio's elite provider network.Empower and supercharge our partners, zealous patient advocates, and provider engagement teams. Analyze, optimize, and reinvent for unparalleled success.Be the driving force behind skyrocketing international enrollment rates. Every day is an opportunity to make a difference.Seize opportunities to mingle with physicians and providers, constantly broadening our influential network.Command the P&Ls with finesse, maximizing profits and minimizing losses across diverse terrains.Become the compass for our marketing teams, guiding them with continuous feedback and razor-sharp strategic plans.Push the boundaries! Contribute to Massive Bio’s trailblazing initiatives. Spot the goldmines and sprint towards unmatched growth opportunities, ensuring a stellar ROI.Candidate Profile:BS/BA degree or equivalent experience.5+ years’ experience in channel partnership development or business development in oncology/hematology healthcare tech, healthcare, or pharma companies.Exceptional relationship-building skills.Fluent in English and native in the local language.Preferably, familiarity with medical terminology and health care systems.Able to adapt to situations quickly, with a start-up mindset.Flexible in traveling internationally, 50%+ travel.Excellent overall communication skills.Thrive in a fast-paced environment.Proactive, passionate about client work, detail and quality oriented, comfortable with ambiguity, data-driven, and growth mindset.Living in Germany.Candidate who work permit in Romania. Powered by JazzHRIXjvvjYwQA\n      ", "job_level": "Mid-Senior level", "job_program_type": "Full-time", "job_category": "Sales and Business Development", "job_activity_sector": "Internet Publishing"},
{"job_url": "https://ro.linkedin.com/jobs/view/business-analyst-at-talent-matchmakers-3708467731?refId=E873y%2FHzfEZ3IECgwjuahw%3D%3D&trackingId=5jQ4na5dF7ZGHfIR0tK8Vw%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card", "job_title": "BUSINESS ANALYST", "job_company": "Talent Matchmakers", "job_nr_candidates": "36", "job_description": "\nAbout The RoleWe are looking for a Business Analyst for a US headquartered product company with offices in the UK and Romania (Cluj-Napoca).They are specialising in migrating customers' increasing volumes of data to the cloud and managing it securely. Their patented software is the only true PaaS information management platform in the industry. It empowers enterprises, government agencies, and IT service providers worldwide to bring control, context, and compliance to their digital transformation and cloud adoption.  Join their international team of experts to build an incredible career for yourself and create a more secure digital world for all.They value quality, they deliver on time, they develop iteratively from healthy foundations, and they constantly communicate, so they expect the Business Analyst to adhere to these best practices.Duties And Responsibilitieshave ownership on the company's compliance;create Product Requirement Documentation;create End User documentation;create documentation for internal and external trainings;create APIs and Product Demos for customers;build strong relationships internally and externallyRequirementsproven track record in a similar role;excellent verbal and written communication skills;experience in creating documentation;deep understanding of software development processes;availability to work occasionally as per US East Coast Time;availability to travel occasionally in US;organised, self-driven and detail-oriented;good analytical skills;great English communication skills.\n", "job_level": "Mid-Senior level", "job_program_type": "Full-time", "job_category": "Research, Analyst, and Information Technology", "job_activity_sector": "Human Resources Services"},
{"job_url": "https://ro.linkedin.com/jobs/view/executive-assistant-to-the-ceo-remote-at-siena-ai-3696158446?refId=E873y%2FHzfEZ3IECgwjuahw%3D%3D&trackingId=qu4Hem0QkBsbFsImi58wvA%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card", "job_title": "Executive Assistant to the CEO (Remote)", "job_company": "Siena AI", "job_nr_candidates": "107", "job_description": "\n        At Siena, we are building the world's first autonomous customer service platform, leveraging artificial intelligence to enable machines to engage in useful and empathic conversations. Our platform is the first of its kind, designed to work out-of-the-box to effectively solve customer problems across all digital channels.Our self-service, autonomous CX platform uses advanced natural language processing techniques to communicate with customers in a natural tone and promptly answer questions, while also utilizing conversation redirecting algorithms to develop a human + AI operating model. As a result, companies see a significant reduction in ticket backlogs, a marked improvement in customer experience, improved ability to manage unpredictable conversation volumes, and an increase in agent capacity to handle high empathy cases.If you're excited about artificial intelligence and the intersection of human-to-machine communications, and want to be part of a remote team who is driving innovation and making a real impact, then come join us in pushing the boundaries of AI and CX performance.Team and CultureHere are some of our core values to give you a sense of who we are as a team:Ownership. We build, we celebrate and we take responsibility even when things don't pan out. Set the pace. We move fast, take risks, and chase big outcomes wherever possible. We’re creating an environment where we can act fearlessly, a consensus isn’t needed for every action, and experimentation and failure (plus learning) are key. Autonomy. We unblock ourselves, focus on solutions and work towards our goals. Honor execution. Fewer meetings, less of the stuff things that don't make an impact, more action. Move fast and focus on execution instead of talking. Continuous feedback. We are open to feedback and make a habit of sharing feedback with others. Writing > talking. We’re creating a culture where people can do their best critical thinking and use data to solve problems. What you'll be working onAs an Executive Assistant, you will support our founder and CEO. Your responsibilities will include involvement in all aspects of our startup and its day-to-day operations. This is the perfect position for one with a strong interest in learning entrepreneurship and leadership beyond an assistant role.Manage and maintain the CEO's complex calendar, including scheduling meetings, appointments, and travel arrangements. Reply to emails, send follow-ups and create internal and external communications. Conduct research and prepare reports, memos, and other documents as required. Manage travel & expenses. Organize events, including team meetings, conferences, and webinars. Help support with payroll, accounting, and reporting. Coordinate and prepare materials for meetings, investor updates, memos, conferences, and presentations. Organize and prioritize incoming correspondence, including email, phone calls, and messages. Liaise with internal and external stakeholders, ensuring efficient communication and collaboration. Assist with special projects and initiatives as needed. Handle sensitive and confidential information with discretion. What are the requirements?At least 2 years of experience as an executive assistant or similar role, preferably supporting C-level executives. Exceptional organizational and time management skills, with the ability to manage multiple tasks and priorities simultaneously. Strong written and verbal communication skills, with a high level of professionalism and discretion. Experience with calendar management, travel arrangements, and meeting coordination. Ability to work independently, remotely, and adapt to rapidly changing priorities. Proactive problem-solving skills, with keen attention to detail. Demonstrated success in a fast-paced, dynamic work environment. Internet connection: 10 Mbps minimumWillingness to work full-time (40 hours/week) at a time that suits your client (often PH evenings)Proficiency in Google Suite (Gmail, Calendar, Drive, Docs, Sheets, Forms, Slides) and productivity and project management tools/appsA charismatic can-do attitudeWho are we looking for?We have intentionally set a very high standard for our employees and our culture is also of a high standard of performance (but so is our fun facto!).To qualify for the position: In the application section below under What else do you want to share with us? please add the key phrase: \"We only have one Earth. Let's be good with it.\"We are excited to offer career opportunities to people who show:Self starter. You require minimum supervision to get the job done Inner motivation. You are motivated by impact and driven by wanting to help others Problem solver. You can tackle complex problems and offer creative solutionsHigh bar. You take pride in the quality of your work and see to constantly improveTrust. You embody trust and dependability EQ. Have deep emotional and social intelligenceSystem thinker. You are a processes-driven person Infinite learner. You seek to learn and challenge yourselfEnergy+. You show with a positive attitude (and sense of humor!) even in ambiguous situationsBenefitsYou get a competitive salary and opportunity for career advancementYou are part of a fully remote job and cultureYou get an educational budget to fuel your growthBenefits🏠 The flexibility to work from anywhere, even if it's just from the comfort of your own bed (because let's face it, who doesn't love a good WFH situation?)🌞 Flexible working hours, because who said you can't design your day on your terms?💸 Competitive salaries, smaller egos. We offer highly competitive salaries and equity, because we're building this together. 🌴 Time off? More like time on. With unlimited paid time off and a minimum of 15 days off per year, you'll have plenty of time to explore the world (or just your couch). 📖 \"Edu-tainment\" budget - an annual budget to continue learning and expanding your horizons. It's like getting a raise without having to ask for it. We invest in you, so you can continue to invest in yourself. At Siena AI, we’re not just looking for people who can do a job. We’re looking for people who want to break boundaries, create the future, and redefine the world of B2B SaaS. If that’s you, we look forward to your application.Siena provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, genetics, sexual orientation, gender identity, or gender expression. We are committed to a diverse and inclusive workforce and welcome people from all backgrounds, experiences, perspectives, and abilities.\n", "job_level": "Mid-Senior level", "job_program_type": "Full-time", "job_category": "Administrative", "job_activity_sector": "Technology, Information and Internet"},
{"job_url": "https://ro.linkedin.com/jobs/view/junior-sql-programmer-at-yardi-romania-3708843690?refId=E873y%2FHzfEZ3IECgwjuahw%3D%3D&trackingId=Z2ysrcvIjHd9zauPKyhvaw%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card", "job_title": "Junior SQL Programmer", "job_company": "Yardi Romania", "job_nr_candidates": 0, "job_description": "\n        We are looking for a Junior Programmer with a passion for SQL to join our local Technical Cases team.As a member of our team, you will provide excellent service to our global and European clients through the resolution of complex data issues and the development of client-specific solutions within Yardi's web-based Voyager ERP software product.Our main goal is to support non-technical teams with the more complex issues (we call them cases) reported by clients. Anything that involves a deeper look into the database, and data fixes, from the most common and simple ones like updating the date of a transaction to more complex ones like creating stored procedures, and functions, improving performance, small adjustments to existing custom reports, etc., can be assigned to our team to review and identify the best solution.As you're only getting started, you'll have a mentor who will guide, advise, and coach you, and you'll also benefit from your colleagues' help and collaboration.This position is available in a hybrid regime that implies working from the office on a weekly basis.What We're Looking ForTop university student or graduate, with a degree in Economic Informatics or Computer Science;Strong knowledge of SQL;Good English skills;Solid programming skills;Very strong analytical skills;Excellent organizational skills;Ability to work independently and as part of a team.What You'll DoUnderstand the functionalities of the ERP system and the underlying complex data schema;Investigate client-reported issues and perform root cause analysis;Write complex and complete scripts to resolve data issues;Understand client's business requirements and processes to develop custom solutions;Develop custom reports and functionalities that match client-specific needs using the appropriate tools;Test custom reports and functionalities.We Also Offer a Competitive Benefits Package IncludingHighly competitive salary;Up to two thousand USD educational reimbursement plan/calendar year;Comprehensive private medical and life insurance plan;Flexible work schedule;Modern technology, work methods and tools;Possibility to participate in various training programs and conferences;Thirty RON/day meal tickets;Frequent internal engagement activities, themed parties & team-buildings.Discount plans for fitness centers, restaurants and various service providers.Fresh fruit, snacks and coffee in the office;Open air terraces, game rooms;Company detailsYardi Romania is part of Yardi Systems, Inc., an American company founded in 1984 that has become the leading provider of software solutions for the real estate industry, with over 45 offices and 8000+ employees worldwide. Our development center in Cluj-Napoca, opened in 2010, is the second largest Yardi office in the world – counting over 1200 dedicated professionals with highly diverse skill sets, ranging from software development to data research and analysis, marketing, journalism, consulting, and customer service.Our success belongs to our employees, who make Yardi Romania an amazing place to work and grow.\n      ", "job_level": "Entry level", "job_program_type": "Full-time", "job_category": "Information Technology", "job_activity_sector": "Software Development"},
{"job_url": "https://ro.linkedin.com/jobs/view/data-engineer-at-mindera-3709527333?refId=E873y%2FHzfEZ3IECgwjuahw%3D%3D&trackingId=qKH04wf31QRfql%2FcHVt%2FwQ%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card", "job_title": "Data Engineer", "job_company": "Mindera", "job_nr_candidates": "53", "job_description": "\n        At Mindera, we craft software with people we love. 💛We're looking for a DATA ENGINEER to join our team!As a Data Engineer, you will be responsible for building, maintaining, scaling, and integrating big data based platforms. You will also be working with the Data Science team in setting up and automating the Data Science models/algorithms for production use.This is a fantastic opportunity for someone who is passionate about Data and is excited to use different tools to provide data insight for further analysis in driving business decisions.When you join Mindera we welcome you into a fun and politics-free work culture, built on the principles of lean and self-organisation.Note: Depending on the project and our clients' needs, you may get the chance to pack your bags and take off every now and then. Typically, we estimate travel time to be between 0% and 15%.HOW YOU’LL MAKE AN IMPACT:Building and optimizing ETL / ELT data pipelines using Modern Data Stack tools;Working with raw data, structured and semi-structured;Transforming the raw data into those data models using SQL and dbt;Supporting and working with BI and Analytics teams in a dynamic environment;Collaborating and effectively pair programming with other engineers;Solving business problems by modeling business events following the best practices of Agile Data Warehouse Design;Designing dimensional data models using the Kimball approach for the Data Warehouse;Designing and implementing event-driven serverless data services for ingestion and exporting of data into and from the Data Warehouse;Setting up the ingestion of new data sources using client's in-house serverless event-driven ingestion platformRequirementsYOUR SKILLS & EXPERIENCE:Knowledge of Object-oriented Programming languages;Advanced experience with Data Modelling such as Kimball techniques;Advanced experience with Data Warehouse Design;Advanced working SQL knowledge and experience working with relational databases, as well as familiarity with one or more cloud-based data warehouses such as Snowflake, Redshift, BigQuery;Experience with DBT (data build tool);Experience with Python, Shell Script;Experience with IaC tools such as Terraform, Cloudformation;Experience with source control, Continuous Integration, Delivery, and Deployment through CI Pipelines;Previous experience working with AWS cloud services in production (API Gateway, AWS Lambda, SSM, SNS, SQS, Firehose, S3, SageMaker, etc) is a plus;Knowledge of Scrum, Kanban, or other agile frameworks is beneficial, but not requiredWe'd love to get to know you better!BenefitsTHE PERKS OF BECOMING A MINDER:Private medical subscriptionCounseling and psychotherapy servicesSelf-proposal salary processAnnual profit distribution, subject to company performance and board decisionMindera Unit PlanFlexible benefits options (sports, medical, cultural, donations)Trainings and learning opportunities to grow within your roleCoaching and development guidance25 days holiday (+ bank holidays)Flexibility to choose where you work fromVacation incentiveParties, gatherings & tripsWHY MINDERA?We're thrilled to have the opportunity to share with you what it's like to be a part of the Mindera community.We're a group of friendly and talented individuals who work together to bring projects to life, in a fun, politics-free environment.Our culture is all about being adaptable and self-organized. We want Minders to take risks, make decisions, work together and feel free to be their most authentic selves, every single day.We work closely with our clients to truly understand their products and develop high-performance, resilient, and scalable software systems that make a real impact for their users and businesses, worldwide.We are proud of our work, we're always learning and growing in our Agile and collaborative environment, and we hope you'll love it here just as much as we do!Check out our Handbook & get to know us better: http://bit.ly/MinderaHandbookMindera around the world: Porto, Portugal | Aveiro, Portugal | Coimbra, Portugal | Leicester, UK | San Diego, USA | San Francisco, USA | Chennai, India | Bengaluru, India | Blumenau, Brazil | Cluj-Napoca, Romania | Valencia, Spain | Casablanca, Morocco & Remote\n      ", "job_level": "Mid-Senior level", "job_program_type": "Full-time", "job_category": "Information Technology", "job_activity_sector": "Technology, Information and Internet"}
]